Model: "model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 128, 128, 64 0                                            
__________________________________________________________________________________________________
conv3d (Conv3D)                 (None, 128, 128, 64, 448         input_1[0][0]                    
__________________________________________________________________________________________________
batch_normalization (BatchNorma (None, 128, 128, 64, 64          conv3d[0][0]                     
__________________________________________________________________________________________________
leaky_re_lu (LeakyReLU)         (None, 128, 128, 64, 0           batch_normalization[0][0]        
__________________________________________________________________________________________________
conv3d_1 (Conv3D)               (None, 128, 128, 64, 6928        leaky_re_lu[0][0]                
__________________________________________________________________________________________________
batch_normalization_1 (BatchNor (None, 128, 128, 64, 64          conv3d_1[0][0]                   
__________________________________________________________________________________________________
leaky_re_lu_1 (LeakyReLU)       (None, 128, 128, 64, 0           batch_normalization_1[0][0]      
__________________________________________________________________________________________________
conv3d_2 (Conv3D)               (None, 128, 128, 64, 6928        leaky_re_lu_1[0][0]              
__________________________________________________________________________________________________
batch_normalization_2 (BatchNor (None, 128, 128, 64, 64          conv3d_2[0][0]                   
__________________________________________________________________________________________________
leaky_re_lu_2 (LeakyReLU)       (None, 128, 128, 64, 0           batch_normalization_2[0][0]      
__________________________________________________________________________________________________
add (Add)                       (None, 128, 128, 64, 0           leaky_re_lu[0][0]                
                                                                 leaky_re_lu_2[0][0]              
__________________________________________________________________________________________________
conv3d_3 (Conv3D)               (None, 64, 64, 32, 3 13856       add[0][0]                        
__________________________________________________________________________________________________
batch_normalization_3 (BatchNor (None, 64, 64, 32, 3 128         conv3d_3[0][0]                   
__________________________________________________________________________________________________
leaky_re_lu_3 (LeakyReLU)       (None, 64, 64, 32, 3 0           batch_normalization_3[0][0]      
__________________________________________________________________________________________________
conv3d_4 (Conv3D)               (None, 64, 64, 32, 3 27680       leaky_re_lu_3[0][0]              
__________________________________________________________________________________________________
batch_normalization_4 (BatchNor (None, 64, 64, 32, 3 128         conv3d_4[0][0]                   
__________________________________________________________________________________________________
leaky_re_lu_4 (LeakyReLU)       (None, 64, 64, 32, 3 0           batch_normalization_4[0][0]      
__________________________________________________________________________________________________
conv3d_5 (Conv3D)               (None, 64, 64, 32, 3 27680       leaky_re_lu_4[0][0]              
__________________________________________________________________________________________________
batch_normalization_5 (BatchNor (None, 64, 64, 32, 3 128         conv3d_5[0][0]                   
__________________________________________________________________________________________________
leaky_re_lu_5 (LeakyReLU)       (None, 64, 64, 32, 3 0           batch_normalization_5[0][0]      
__________________________________________________________________________________________________
add_1 (Add)                     (None, 64, 64, 32, 3 0           leaky_re_lu_3[0][0]              
                                                                 leaky_re_lu_5[0][0]              
__________________________________________________________________________________________________
conv3d_6 (Conv3D)               (None, 32, 32, 16, 6 55360       add_1[0][0]                      
__________________________________________________________________________________________________
batch_normalization_6 (BatchNor (None, 32, 32, 16, 6 256         conv3d_6[0][0]                   
__________________________________________________________________________________________________
leaky_re_lu_6 (LeakyReLU)       (None, 32, 32, 16, 6 0           batch_normalization_6[0][0]      
__________________________________________________________________________________________________
conv3d_7 (Conv3D)               (None, 32, 32, 16, 6 110656      leaky_re_lu_6[0][0]              
__________________________________________________________________________________________________
batch_normalization_7 (BatchNor (None, 32, 32, 16, 6 256         conv3d_7[0][0]                   
__________________________________________________________________________________________________
leaky_re_lu_7 (LeakyReLU)       (None, 32, 32, 16, 6 0           batch_normalization_7[0][0]      
__________________________________________________________________________________________________
conv3d_8 (Conv3D)               (None, 32, 32, 16, 6 110656      leaky_re_lu_7[0][0]              
__________________________________________________________________________________________________
batch_normalization_8 (BatchNor (None, 32, 32, 16, 6 256         conv3d_8[0][0]                   
__________________________________________________________________________________________________
leaky_re_lu_8 (LeakyReLU)       (None, 32, 32, 16, 6 0           batch_normalization_8[0][0]      
__________________________________________________________________________________________________
add_2 (Add)                     (None, 32, 32, 16, 6 0           leaky_re_lu_6[0][0]              
                                                                 leaky_re_lu_8[0][0]              
__________________________________________________________________________________________________
conv3d_9 (Conv3D)               (None, 16, 16, 8, 12 221312      add_2[0][0]                      
__________________________________________________________________________________________________
batch_normalization_9 (BatchNor (None, 16, 16, 8, 12 512         conv3d_9[0][0]                   
__________________________________________________________________________________________________
leaky_re_lu_9 (LeakyReLU)       (None, 16, 16, 8, 12 0           batch_normalization_9[0][0]      
__________________________________________________________________________________________________
conv3d_10 (Conv3D)              (None, 16, 16, 8, 12 442496      leaky_re_lu_9[0][0]              
__________________________________________________________________________________________________
batch_normalization_10 (BatchNo (None, 16, 16, 8, 12 512         conv3d_10[0][0]                  
__________________________________________________________________________________________________
leaky_re_lu_10 (LeakyReLU)      (None, 16, 16, 8, 12 0           batch_normalization_10[0][0]     
__________________________________________________________________________________________________
conv3d_11 (Conv3D)              (None, 16, 16, 8, 12 442496      leaky_re_lu_10[0][0]             
__________________________________________________________________________________________________
batch_normalization_11 (BatchNo (None, 16, 16, 8, 12 512         conv3d_11[0][0]                  
__________________________________________________________________________________________________
leaky_re_lu_11 (LeakyReLU)      (None, 16, 16, 8, 12 0           batch_normalization_11[0][0]     
__________________________________________________________________________________________________
add_3 (Add)                     (None, 16, 16, 8, 12 0           leaky_re_lu_9[0][0]              
                                                                 leaky_re_lu_11[0][0]             
__________________________________________________________________________________________________
conv3d_12 (Conv3D)              (None, 8, 8, 4, 256) 884992      add_3[0][0]                      
__________________________________________________________________________________________________
batch_normalization_12 (BatchNo (None, 8, 8, 4, 256) 1024        conv3d_12[0][0]                  
__________________________________________________________________________________________________
leaky_re_lu_12 (LeakyReLU)      (None, 8, 8, 4, 256) 0           batch_normalization_12[0][0]     
__________________________________________________________________________________________________
conv3d_13 (Conv3D)              (None, 8, 8, 4, 256) 1769728     leaky_re_lu_12[0][0]             
__________________________________________________________________________________________________
batch_normalization_13 (BatchNo (None, 8, 8, 4, 256) 1024        conv3d_13[0][0]                  
__________________________________________________________________________________________________
leaky_re_lu_13 (LeakyReLU)      (None, 8, 8, 4, 256) 0           batch_normalization_13[0][0]     
__________________________________________________________________________________________________
conv3d_14 (Conv3D)              (None, 8, 8, 4, 256) 1769728     leaky_re_lu_13[0][0]             
__________________________________________________________________________________________________
batch_normalization_14 (BatchNo (None, 8, 8, 4, 256) 1024        conv3d_14[0][0]                  
__________________________________________________________________________________________________
leaky_re_lu_14 (LeakyReLU)      (None, 8, 8, 4, 256) 0           batch_normalization_14[0][0]     
__________________________________________________________________________________________________
add_4 (Add)                     (None, 8, 8, 4, 256) 0           leaky_re_lu_12[0][0]             
                                                                 leaky_re_lu_14[0][0]             
__________________________________________________________________________________________________
conv3d_15 (Conv3D)              (None, 4, 4, 2, 512) 3539456     add_4[0][0]                      
__________________________________________________________________________________________________
batch_normalization_15 (BatchNo (None, 4, 4, 2, 512) 2048        conv3d_15[0][0]                  
__________________________________________________________________________________________________
leaky_re_lu_15 (LeakyReLU)      (None, 4, 4, 2, 512) 0           batch_normalization_15[0][0]     
__________________________________________________________________________________________________
conv3d_16 (Conv3D)              (None, 4, 4, 2, 512) 7078400     leaky_re_lu_15[0][0]             
__________________________________________________________________________________________________
batch_normalization_16 (BatchNo (None, 4, 4, 2, 512) 2048        conv3d_16[0][0]                  
__________________________________________________________________________________________________
leaky_re_lu_16 (LeakyReLU)      (None, 4, 4, 2, 512) 0           batch_normalization_16[0][0]     
__________________________________________________________________________________________________
conv3d_17 (Conv3D)              (None, 4, 4, 2, 512) 7078400     leaky_re_lu_16[0][0]             
__________________________________________________________________________________________________
batch_normalization_17 (BatchNo (None, 4, 4, 2, 512) 2048        conv3d_17[0][0]                  
__________________________________________________________________________________________________
leaky_re_lu_17 (LeakyReLU)      (None, 4, 4, 2, 512) 0           batch_normalization_17[0][0]     
__________________________________________________________________________________________________
add_5 (Add)                     (None, 4, 4, 2, 512) 0           leaky_re_lu_15[0][0]             
                                                                 leaky_re_lu_17[0][0]             
__________________________________________________________________________________________________
conv3d_18 (Conv3D)              (None, 2, 2, 1, 1024 14156800    add_5[0][0]                      
__________________________________________________________________________________________________
batch_normalization_18 (BatchNo (None, 2, 2, 1, 1024 4096        conv3d_18[0][0]                  
__________________________________________________________________________________________________
leaky_re_lu_18 (LeakyReLU)      (None, 2, 2, 1, 1024 0           batch_normalization_18[0][0]     
__________________________________________________________________________________________________
conv3d_19 (Conv3D)              (None, 2, 2, 1, 1024 28312576    leaky_re_lu_18[0][0]             
__________________________________________________________________________________________________
batch_normalization_19 (BatchNo (None, 2, 2, 1, 1024 4096        conv3d_19[0][0]                  
__________________________________________________________________________________________________
leaky_re_lu_19 (LeakyReLU)      (None, 2, 2, 1, 1024 0           batch_normalization_19[0][0]     
__________________________________________________________________________________________________
conv3d_20 (Conv3D)              (None, 2, 2, 1, 1024 28312576    leaky_re_lu_19[0][0]             
__________________________________________________________________________________________________
batch_normalization_20 (BatchNo (None, 2, 2, 1, 1024 4096        conv3d_20[0][0]                  
__________________________________________________________________________________________________
leaky_re_lu_20 (LeakyReLU)      (None, 2, 2, 1, 1024 0           batch_normalization_20[0][0]     
__________________________________________________________________________________________________
add_6 (Add)                     (None, 2, 2, 1, 1024 0           leaky_re_lu_18[0][0]             
                                                                 leaky_re_lu_20[0][0]             
__________________________________________________________________________________________________
up_sampling3d (UpSampling3D)    (None, 4, 4, 2, 1024 0           add_6[0][0]                      
__________________________________________________________________________________________________
conv3d_21 (Conv3D)              (None, 4, 4, 2, 512) 14156288    up_sampling3d[0][0]              
__________________________________________________________________________________________________
batch_normalization_21 (BatchNo (None, 4, 4, 2, 512) 2048        conv3d_21[0][0]                  
__________________________________________________________________________________________________
leaky_re_lu_21 (LeakyReLU)      (None, 4, 4, 2, 512) 0           batch_normalization_21[0][0]     
__________________________________________________________________________________________________
concatenate (Concatenate)       (None, 4, 4, 2, 1024 0           leaky_re_lu_21[0][0]             
                                                                 add_5[0][0]                      
__________________________________________________________________________________________________
conv3d_22 (Conv3D)              (None, 4, 4, 2, 512) 14156288    concatenate[0][0]                
__________________________________________________________________________________________________
batch_normalization_22 (BatchNo (None, 4, 4, 2, 512) 2048        conv3d_22[0][0]                  
__________________________________________________________________________________________________
leaky_re_lu_22 (LeakyReLU)      (None, 4, 4, 2, 512) 0           batch_normalization_22[0][0]     
__________________________________________________________________________________________________
conv3d_23 (Conv3D)              (None, 4, 4, 2, 512) 7078400     leaky_re_lu_22[0][0]             
__________________________________________________________________________________________________
batch_normalization_23 (BatchNo (None, 4, 4, 2, 512) 2048        conv3d_23[0][0]                  
__________________________________________________________________________________________________
leaky_re_lu_23 (LeakyReLU)      (None, 4, 4, 2, 512) 0           batch_normalization_23[0][0]     
__________________________________________________________________________________________________
up_sampling3d_1 (UpSampling3D)  (None, 8, 8, 4, 512) 0           leaky_re_lu_23[0][0]             
__________________________________________________________________________________________________
conv3d_24 (Conv3D)              (None, 8, 8, 4, 256) 3539200     up_sampling3d_1[0][0]            
__________________________________________________________________________________________________
batch_normalization_24 (BatchNo (None, 8, 8, 4, 256) 1024        conv3d_24[0][0]                  
__________________________________________________________________________________________________
leaky_re_lu_24 (LeakyReLU)      (None, 8, 8, 4, 256) 0           batch_normalization_24[0][0]     
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 8, 8, 4, 512) 0           leaky_re_lu_24[0][0]             
                                                                 add_4[0][0]                      
__________________________________________________________________________________________________
conv3d_25 (Conv3D)              (None, 8, 8, 4, 256) 3539200     concatenate_1[0][0]              
__________________________________________________________________________________________________
batch_normalization_25 (BatchNo (None, 8, 8, 4, 256) 1024        conv3d_25[0][0]                  
__________________________________________________________________________________________________
leaky_re_lu_25 (LeakyReLU)      (None, 8, 8, 4, 256) 0           batch_normalization_25[0][0]     
__________________________________________________________________________________________________
conv3d_26 (Conv3D)              (None, 8, 8, 4, 256) 1769728     leaky_re_lu_25[0][0]             
__________________________________________________________________________________________________
batch_normalization_26 (BatchNo (None, 8, 8, 4, 256) 1024        conv3d_26[0][0]                  
__________________________________________________________________________________________________
leaky_re_lu_26 (LeakyReLU)      (None, 8, 8, 4, 256) 0           batch_normalization_26[0][0]     
__________________________________________________________________________________________________
up_sampling3d_2 (UpSampling3D)  (None, 16, 16, 8, 25 0           leaky_re_lu_26[0][0]             
__________________________________________________________________________________________________
conv3d_27 (Conv3D)              (None, 16, 16, 8, 12 884864      up_sampling3d_2[0][0]            
__________________________________________________________________________________________________
batch_normalization_27 (BatchNo (None, 16, 16, 8, 12 512         conv3d_27[0][0]                  
__________________________________________________________________________________________________
leaky_re_lu_27 (LeakyReLU)      (None, 16, 16, 8, 12 0           batch_normalization_27[0][0]     
__________________________________________________________________________________________________
concatenate_2 (Concatenate)     (None, 16, 16, 8, 25 0           leaky_re_lu_27[0][0]             
                                                                 add_3[0][0]                      
__________________________________________________________________________________________________
conv3d_28 (Conv3D)              (None, 16, 16, 8, 12 884864      concatenate_2[0][0]              
__________________________________________________________________________________________________
batch_normalization_28 (BatchNo (None, 16, 16, 8, 12 512         conv3d_28[0][0]                  
__________________________________________________________________________________________________
leaky_re_lu_28 (LeakyReLU)      (None, 16, 16, 8, 12 0           batch_normalization_28[0][0]     
__________________________________________________________________________________________________
conv3d_29 (Conv3D)              (None, 16, 16, 8, 12 442496      leaky_re_lu_28[0][0]             
__________________________________________________________________________________________________
batch_normalization_29 (BatchNo (None, 16, 16, 8, 12 512         conv3d_29[0][0]                  
__________________________________________________________________________________________________
leaky_re_lu_29 (LeakyReLU)      (None, 16, 16, 8, 12 0           batch_normalization_29[0][0]     
__________________________________________________________________________________________________
up_sampling3d_3 (UpSampling3D)  (None, 32, 32, 16, 1 0           leaky_re_lu_29[0][0]             
__________________________________________________________________________________________________
conv3d_30 (Conv3D)              (None, 32, 32, 16, 6 221248      up_sampling3d_3[0][0]            
__________________________________________________________________________________________________
batch_normalization_30 (BatchNo (None, 32, 32, 16, 6 256         conv3d_30[0][0]                  
__________________________________________________________________________________________________
leaky_re_lu_30 (LeakyReLU)      (None, 32, 32, 16, 6 0           batch_normalization_30[0][0]     
__________________________________________________________________________________________________
concatenate_3 (Concatenate)     (None, 32, 32, 16, 1 0           leaky_re_lu_30[0][0]             
                                                                 add_2[0][0]                      
__________________________________________________________________________________________________
conv3d_31 (Conv3D)              (None, 32, 32, 16, 6 221248      concatenate_3[0][0]              
__________________________________________________________________________________________________
batch_normalization_31 (BatchNo (None, 32, 32, 16, 6 256         conv3d_31[0][0]                  
__________________________________________________________________________________________________
leaky_re_lu_31 (LeakyReLU)      (None, 32, 32, 16, 6 0           batch_normalization_31[0][0]     
__________________________________________________________________________________________________
conv3d_32 (Conv3D)              (None, 32, 32, 16, 6 110656      leaky_re_lu_31[0][0]             
__________________________________________________________________________________________________
batch_normalization_32 (BatchNo (None, 32, 32, 16, 6 256         conv3d_32[0][0]                  
__________________________________________________________________________________________________
leaky_re_lu_32 (LeakyReLU)      (None, 32, 32, 16, 6 0           batch_normalization_32[0][0]     
__________________________________________________________________________________________________
up_sampling3d_5 (UpSampling3D)  (None, 64, 64, 32, 6 0           leaky_re_lu_32[0][0]             
__________________________________________________________________________________________________
conv3d_34 (Conv3D)              (None, 64, 64, 32, 3 55328       up_sampling3d_5[0][0]            
__________________________________________________________________________________________________
batch_normalization_34 (BatchNo (None, 64, 64, 32, 3 128         conv3d_34[0][0]                  
__________________________________________________________________________________________________
leaky_re_lu_34 (LeakyReLU)      (None, 64, 64, 32, 3 0           batch_normalization_34[0][0]     
__________________________________________________________________________________________________
concatenate_4 (Concatenate)     (None, 64, 64, 32, 6 0           leaky_re_lu_34[0][0]             
                                                                 add_1[0][0]                      
__________________________________________________________________________________________________
conv3d_35 (Conv3D)              (None, 64, 64, 32, 3 55328       concatenate_4[0][0]              
__________________________________________________________________________________________________
batch_normalization_35 (BatchNo (None, 64, 64, 32, 3 128         conv3d_35[0][0]                  
__________________________________________________________________________________________________
leaky_re_lu_35 (LeakyReLU)      (None, 64, 64, 32, 3 0           batch_normalization_35[0][0]     
__________________________________________________________________________________________________
conv3d_36 (Conv3D)              (None, 64, 64, 32, 3 27680       leaky_re_lu_35[0][0]             
__________________________________________________________________________________________________
batch_normalization_36 (BatchNo (None, 64, 64, 32, 3 128         conv3d_36[0][0]                  
__________________________________________________________________________________________________
leaky_re_lu_36 (LeakyReLU)      (None, 64, 64, 32, 3 0           batch_normalization_36[0][0]     
__________________________________________________________________________________________________
up_sampling3d_7 (UpSampling3D)  (None, 128, 128, 64, 0           leaky_re_lu_36[0][0]             
__________________________________________________________________________________________________
conv3d_38 (Conv3D)              (None, 128, 128, 64, 13840       up_sampling3d_7[0][0]            
__________________________________________________________________________________________________
batch_normalization_38 (BatchNo (None, 128, 128, 64, 64          conv3d_38[0][0]                  
__________________________________________________________________________________________________
leaky_re_lu_38 (LeakyReLU)      (None, 128, 128, 64, 0           batch_normalization_38[0][0]     
__________________________________________________________________________________________________
concatenate_5 (Concatenate)     (None, 128, 128, 64, 0           leaky_re_lu_38[0][0]             
                                                                 add[0][0]                        
__________________________________________________________________________________________________
conv3d_39 (Conv3D)              (None, 128, 128, 64, 13840       concatenate_5[0][0]              
__________________________________________________________________________________________________
batch_normalization_39 (BatchNo (None, 128, 128, 64, 64          conv3d_39[0][0]                  
__________________________________________________________________________________________________
leaky_re_lu_39 (LeakyReLU)      (None, 128, 128, 64, 0           batch_normalization_39[0][0]     
__________________________________________________________________________________________________
conv3d_40 (Conv3D)              (None, 128, 128, 64, 6928        leaky_re_lu_39[0][0]             
__________________________________________________________________________________________________
conv3d_33 (Conv3D)              (None, 32, 32, 16, 1 1729        leaky_re_lu_32[0][0]             
__________________________________________________________________________________________________
batch_normalization_40 (BatchNo (None, 128, 128, 64, 64          conv3d_40[0][0]                  
__________________________________________________________________________________________________
conv3d_37 (Conv3D)              (None, 64, 64, 32, 1 865         leaky_re_lu_36[0][0]             
__________________________________________________________________________________________________
batch_normalization_33 (BatchNo (None, 32, 32, 16, 1 4           conv3d_33[0][0]                  
__________________________________________________________________________________________________
leaky_re_lu_40 (LeakyReLU)      (None, 128, 128, 64, 0           batch_normalization_40[0][0]     
__________________________________________________________________________________________________
batch_normalization_37 (BatchNo (None, 64, 64, 32, 1 4           conv3d_37[0][0]                  
__________________________________________________________________________________________________
leaky_re_lu_33 (LeakyReLU)      (None, 32, 32, 16, 1 0           batch_normalization_33[0][0]     
__________________________________________________________________________________________________
conv3d_41 (Conv3D)              (None, 128, 128, 64, 433         leaky_re_lu_40[0][0]             
__________________________________________________________________________________________________
leaky_re_lu_37 (LeakyReLU)      (None, 64, 64, 32, 1 0           batch_normalization_37[0][0]     
__________________________________________________________________________________________________
up_sampling3d_4 (UpSampling3D)  (None, 64, 64, 32, 1 0           leaky_re_lu_33[0][0]             
__________________________________________________________________________________________________
batch_normalization_41 (BatchNo (None, 128, 128, 64, 4           conv3d_41[0][0]                  
__________________________________________________________________________________________________
add_7 (Add)                     (None, 64, 64, 32, 1 0           leaky_re_lu_37[0][0]             
                                                                 up_sampling3d_4[0][0]            
__________________________________________________________________________________________________
leaky_re_lu_41 (LeakyReLU)      (None, 128, 128, 64, 0           batch_normalization_41[0][0]     
__________________________________________________________________________________________________
up_sampling3d_6 (UpSampling3D)  (None, 128, 128, 64, 0           add_7[0][0]                      
__________________________________________________________________________________________________
add_8 (Add)                     (None, 128, 128, 64, 0           leaky_re_lu_41[0][0]             
                                                                 up_sampling3d_6[0][0]            
__________________________________________________________________________________________________
conv3d_42 (Conv3D)              (None, 128, 128, 64, 28          add_8[0][0]                      
__________________________________________________________________________________________________
batch_normalization_42 (BatchNo (None, 128, 128, 64, 4           conv3d_42[0][0]                  
__________________________________________________________________________________________________
leaky_re_lu_42 (LeakyReLU)      (None, 128, 128, 64, 0           batch_normalization_42[0][0]     
__________________________________________________________________________________________________
softmax (Activation)            (None, 128, 128, 64, 0           leaky_re_lu_42[0][0]             
==================================================================================================
Total params: 141,586,127
Trainable params: 141,567,879
Non-trainable params: 18,248
__________________________________________________________________________________________________
