Model: "model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 512, 512, 25 0                                            
__________________________________________________________________________________________________
conv3d (Conv3D)                 (None, 512, 512, 256 448         input_1[0][0]                    
__________________________________________________________________________________________________
batch_normalization (BatchNorma (None, 512, 512, 256 64          conv3d[0][0]                     
__________________________________________________________________________________________________
leaky_re_lu (LeakyReLU)         (None, 512, 512, 256 0           batch_normalization[0][0]        
__________________________________________________________________________________________________
conv3d_1 (Conv3D)               (None, 512, 512, 256 6928        leaky_re_lu[0][0]                
__________________________________________________________________________________________________
batch_normalization_1 (BatchNor (None, 512, 512, 256 64          conv3d_1[0][0]                   
__________________________________________________________________________________________________
leaky_re_lu_1 (LeakyReLU)       (None, 512, 512, 256 0           batch_normalization_1[0][0]      
__________________________________________________________________________________________________
conv3d_2 (Conv3D)               (None, 512, 512, 256 6928        leaky_re_lu_1[0][0]              
__________________________________________________________________________________________________
batch_normalization_2 (BatchNor (None, 512, 512, 256 64          conv3d_2[0][0]                   
__________________________________________________________________________________________________
leaky_re_lu_2 (LeakyReLU)       (None, 512, 512, 256 0           batch_normalization_2[0][0]      
__________________________________________________________________________________________________
add (Add)                       (None, 512, 512, 256 0           leaky_re_lu[0][0]                
                                                                 leaky_re_lu_2[0][0]              
__________________________________________________________________________________________________
conv3d_3 (Conv3D)               (None, 256, 256, 128 13856       add[0][0]                        
__________________________________________________________________________________________________
batch_normalization_3 (BatchNor (None, 256, 256, 128 128         conv3d_3[0][0]                   
__________________________________________________________________________________________________
leaky_re_lu_3 (LeakyReLU)       (None, 256, 256, 128 0           batch_normalization_3[0][0]      
__________________________________________________________________________________________________
conv3d_4 (Conv3D)               (None, 256, 256, 128 27680       leaky_re_lu_3[0][0]              
__________________________________________________________________________________________________
batch_normalization_4 (BatchNor (None, 256, 256, 128 128         conv3d_4[0][0]                   
__________________________________________________________________________________________________
leaky_re_lu_4 (LeakyReLU)       (None, 256, 256, 128 0           batch_normalization_4[0][0]      
__________________________________________________________________________________________________
conv3d_5 (Conv3D)               (None, 256, 256, 128 27680       leaky_re_lu_4[0][0]              
__________________________________________________________________________________________________
batch_normalization_5 (BatchNor (None, 256, 256, 128 128         conv3d_5[0][0]                   
__________________________________________________________________________________________________
leaky_re_lu_5 (LeakyReLU)       (None, 256, 256, 128 0           batch_normalization_5[0][0]      
__________________________________________________________________________________________________
add_1 (Add)                     (None, 256, 256, 128 0           leaky_re_lu_3[0][0]              
                                                                 leaky_re_lu_5[0][0]              
__________________________________________________________________________________________________
conv3d_6 (Conv3D)               (None, 128, 128, 64, 55360       add_1[0][0]                      
__________________________________________________________________________________________________
batch_normalization_6 (BatchNor (None, 128, 128, 64, 256         conv3d_6[0][0]                   
__________________________________________________________________________________________________
leaky_re_lu_6 (LeakyReLU)       (None, 128, 128, 64, 0           batch_normalization_6[0][0]      
__________________________________________________________________________________________________
conv3d_7 (Conv3D)               (None, 128, 128, 64, 110656      leaky_re_lu_6[0][0]              
__________________________________________________________________________________________________
batch_normalization_7 (BatchNor (None, 128, 128, 64, 256         conv3d_7[0][0]                   
__________________________________________________________________________________________________
leaky_re_lu_7 (LeakyReLU)       (None, 128, 128, 64, 0           batch_normalization_7[0][0]      
__________________________________________________________________________________________________
conv3d_8 (Conv3D)               (None, 128, 128, 64, 110656      leaky_re_lu_7[0][0]              
__________________________________________________________________________________________________
batch_normalization_8 (BatchNor (None, 128, 128, 64, 256         conv3d_8[0][0]                   
__________________________________________________________________________________________________
leaky_re_lu_8 (LeakyReLU)       (None, 128, 128, 64, 0           batch_normalization_8[0][0]      
__________________________________________________________________________________________________
add_2 (Add)                     (None, 128, 128, 64, 0           leaky_re_lu_6[0][0]              
                                                                 leaky_re_lu_8[0][0]              
__________________________________________________________________________________________________
conv3d_9 (Conv3D)               (None, 64, 64, 32, 1 221312      add_2[0][0]                      
__________________________________________________________________________________________________
batch_normalization_9 (BatchNor (None, 64, 64, 32, 1 512         conv3d_9[0][0]                   
__________________________________________________________________________________________________
leaky_re_lu_9 (LeakyReLU)       (None, 64, 64, 32, 1 0           batch_normalization_9[0][0]      
__________________________________________________________________________________________________
conv3d_10 (Conv3D)              (None, 64, 64, 32, 1 442496      leaky_re_lu_9[0][0]              
__________________________________________________________________________________________________
batch_normalization_10 (BatchNo (None, 64, 64, 32, 1 512         conv3d_10[0][0]                  
__________________________________________________________________________________________________
leaky_re_lu_10 (LeakyReLU)      (None, 64, 64, 32, 1 0           batch_normalization_10[0][0]     
__________________________________________________________________________________________________
conv3d_11 (Conv3D)              (None, 64, 64, 32, 1 442496      leaky_re_lu_10[0][0]             
__________________________________________________________________________________________________
batch_normalization_11 (BatchNo (None, 64, 64, 32, 1 512         conv3d_11[0][0]                  
__________________________________________________________________________________________________
leaky_re_lu_11 (LeakyReLU)      (None, 64, 64, 32, 1 0           batch_normalization_11[0][0]     
__________________________________________________________________________________________________
add_3 (Add)                     (None, 64, 64, 32, 1 0           leaky_re_lu_9[0][0]              
                                                                 leaky_re_lu_11[0][0]             
__________________________________________________________________________________________________
up_sampling3d (UpSampling3D)    (None, 128, 128, 64, 0           add_3[0][0]                      
__________________________________________________________________________________________________
conv3d_12 (Conv3D)              (None, 128, 128, 64, 221248      up_sampling3d[0][0]              
__________________________________________________________________________________________________
batch_normalization_12 (BatchNo (None, 128, 128, 64, 256         conv3d_12[0][0]                  
__________________________________________________________________________________________________
leaky_re_lu_12 (LeakyReLU)      (None, 128, 128, 64, 0           batch_normalization_12[0][0]     
__________________________________________________________________________________________________
concatenate (Concatenate)       (None, 128, 128, 64, 0           leaky_re_lu_12[0][0]             
                                                                 add_2[0][0]                      
__________________________________________________________________________________________________
conv3d_13 (Conv3D)              (None, 128, 128, 64, 221248      concatenate[0][0]                
__________________________________________________________________________________________________
batch_normalization_13 (BatchNo (None, 128, 128, 64, 256         conv3d_13[0][0]                  
__________________________________________________________________________________________________
leaky_re_lu_13 (LeakyReLU)      (None, 128, 128, 64, 0           batch_normalization_13[0][0]     
__________________________________________________________________________________________________
conv3d_14 (Conv3D)              (None, 128, 128, 64, 110656      leaky_re_lu_13[0][0]             
__________________________________________________________________________________________________
batch_normalization_14 (BatchNo (None, 128, 128, 64, 256         conv3d_14[0][0]                  
__________________________________________________________________________________________________
leaky_re_lu_14 (LeakyReLU)      (None, 128, 128, 64, 0           batch_normalization_14[0][0]     
__________________________________________________________________________________________________
up_sampling3d_2 (UpSampling3D)  (None, 256, 256, 128 0           leaky_re_lu_14[0][0]             
__________________________________________________________________________________________________
conv3d_16 (Conv3D)              (None, 256, 256, 128 55328       up_sampling3d_2[0][0]            
__________________________________________________________________________________________________
batch_normalization_16 (BatchNo (None, 256, 256, 128 128         conv3d_16[0][0]                  
__________________________________________________________________________________________________
leaky_re_lu_16 (LeakyReLU)      (None, 256, 256, 128 0           batch_normalization_16[0][0]     
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 256, 256, 128 0           leaky_re_lu_16[0][0]             
                                                                 add_1[0][0]                      
__________________________________________________________________________________________________
conv3d_17 (Conv3D)              (None, 256, 256, 128 55328       concatenate_1[0][0]              
__________________________________________________________________________________________________
batch_normalization_17 (BatchNo (None, 256, 256, 128 128         conv3d_17[0][0]                  
__________________________________________________________________________________________________
leaky_re_lu_17 (LeakyReLU)      (None, 256, 256, 128 0           batch_normalization_17[0][0]     
__________________________________________________________________________________________________
conv3d_18 (Conv3D)              (None, 256, 256, 128 27680       leaky_re_lu_17[0][0]             
__________________________________________________________________________________________________
batch_normalization_18 (BatchNo (None, 256, 256, 128 128         conv3d_18[0][0]                  
__________________________________________________________________________________________________
leaky_re_lu_18 (LeakyReLU)      (None, 256, 256, 128 0           batch_normalization_18[0][0]     
__________________________________________________________________________________________________
up_sampling3d_4 (UpSampling3D)  (None, 512, 512, 256 0           leaky_re_lu_18[0][0]             
__________________________________________________________________________________________________
conv3d_20 (Conv3D)              (None, 512, 512, 256 13840       up_sampling3d_4[0][0]            
__________________________________________________________________________________________________
batch_normalization_20 (BatchNo (None, 512, 512, 256 64          conv3d_20[0][0]                  
__________________________________________________________________________________________________
leaky_re_lu_20 (LeakyReLU)      (None, 512, 512, 256 0           batch_normalization_20[0][0]     
__________________________________________________________________________________________________
concatenate_2 (Concatenate)     (None, 512, 512, 256 0           leaky_re_lu_20[0][0]             
                                                                 add[0][0]                        
__________________________________________________________________________________________________
conv3d_21 (Conv3D)              (None, 512, 512, 256 13840       concatenate_2[0][0]              
__________________________________________________________________________________________________
batch_normalization_21 (BatchNo (None, 512, 512, 256 64          conv3d_21[0][0]                  
__________________________________________________________________________________________________
leaky_re_lu_21 (LeakyReLU)      (None, 512, 512, 256 0           batch_normalization_21[0][0]     
__________________________________________________________________________________________________
conv3d_22 (Conv3D)              (None, 512, 512, 256 6928        leaky_re_lu_21[0][0]             
__________________________________________________________________________________________________
conv3d_15 (Conv3D)              (None, 128, 128, 64, 1729        leaky_re_lu_14[0][0]             
__________________________________________________________________________________________________
batch_normalization_22 (BatchNo (None, 512, 512, 256 64          conv3d_22[0][0]                  
__________________________________________________________________________________________________
conv3d_19 (Conv3D)              (None, 256, 256, 128 865         leaky_re_lu_18[0][0]             
__________________________________________________________________________________________________
batch_normalization_15 (BatchNo (None, 128, 128, 64, 4           conv3d_15[0][0]                  
__________________________________________________________________________________________________
leaky_re_lu_22 (LeakyReLU)      (None, 512, 512, 256 0           batch_normalization_22[0][0]     
__________________________________________________________________________________________________
batch_normalization_19 (BatchNo (None, 256, 256, 128 4           conv3d_19[0][0]                  
__________________________________________________________________________________________________
leaky_re_lu_15 (LeakyReLU)      (None, 128, 128, 64, 0           batch_normalization_15[0][0]     
__________________________________________________________________________________________________
conv3d_23 (Conv3D)              (None, 512, 512, 256 433         leaky_re_lu_22[0][0]             
__________________________________________________________________________________________________
leaky_re_lu_19 (LeakyReLU)      (None, 256, 256, 128 0           batch_normalization_19[0][0]     
__________________________________________________________________________________________________
up_sampling3d_1 (UpSampling3D)  (None, 256, 256, 128 0           leaky_re_lu_15[0][0]             
__________________________________________________________________________________________________
batch_normalization_23 (BatchNo (None, 512, 512, 256 4           conv3d_23[0][0]                  
__________________________________________________________________________________________________
add_4 (Add)                     (None, 256, 256, 128 0           leaky_re_lu_19[0][0]             
                                                                 up_sampling3d_1[0][0]            
__________________________________________________________________________________________________
leaky_re_lu_23 (LeakyReLU)      (None, 512, 512, 256 0           batch_normalization_23[0][0]     
__________________________________________________________________________________________________
up_sampling3d_3 (UpSampling3D)  (None, 512, 512, 256 0           add_4[0][0]                      
__________________________________________________________________________________________________
add_5 (Add)                     (None, 512, 512, 256 0           leaky_re_lu_23[0][0]             
                                                                 up_sampling3d_3[0][0]            
__________________________________________________________________________________________________
conv3d_24 (Conv3D)              (None, 512, 512, 256 28          add_5[0][0]                      
__________________________________________________________________________________________________
batch_normalization_24 (BatchNo (None, 512, 512, 256 4           conv3d_24[0][0]                  
__________________________________________________________________________________________________
leaky_re_lu_24 (LeakyReLU)      (None, 512, 512, 256 0           batch_normalization_24[0][0]     
__________________________________________________________________________________________________
softmax (Activation)            (None, 512, 512, 256 0           leaky_re_lu_24[0][0]             
==================================================================================================
Total params: 2,199,887
Trainable params: 2,197,767
Non-trainable params: 2,120
__________________________________________________________________________________________________
